{
    "skill": {
        "title": "Skills",
        "list": [
            {
                "title": "HTML / CSS / JavaScript / VueJS / ReactJS / NextJS",
                "text": "I possess skills in frontend development to create web pages, functionalities, and integrate APIs. Additionally, I prioritize considerations such as maintenance, scalability, and modular design in my programming approach. In my current work, I mainly focus on client-side rendering (CSR), but I have recently been exploring server-side rendering (SSR) and static site generation (SSG) using Next.js. I also utilize Vercel to seamlessly deploy my projects by connecting with GitHub."
            },
            {
                "title": "PHP / NodeJS / MySQL / Mongodb",
                "text": "In my professional work, I use PHP to develop APIs and also handle database design based on architectural planning. In my personal projects, I have been exploring the use of Node.js with Socket.IO and MongoDB to create a simple chat room application. Additionally, I am currently learning Laravel, a PHP framework, to enhance my skills further."
            },
            {
                "title": "Git",
                "text": "Version control not only allows for the preservation of development steps but also provides insights into individual and team progress, enabling individuals to set goals and improve efficiency."
            },
            {
                "title": "Illustrator / Photoshop / XD",
                "text": "Having a background in fine arts equips me with the ability to communicate and discuss design aspects more effectively with designers and clients within a company setting."
            }
        ]
    },
    "about": {
        "title": "Bio",
        "list": [
            {
                "title": "Learning: Learning by doing.",
                "text": "The learning environments I have experienced in the past have nurtured a sense of freedom and curiosity within me. Throughout the learning process, whenever faced with something new or challenging, I instinctively try to find answers on my own and validate them through hypotheses. This gradual development has shaped my learning style of 'learning by doing,' where I actively confront and solve problems, resulting in a strong sense of accomplishment. Consequently, this learning approach enables me to discern the underlying logic of unknown domains and think critically within those realms."
            },
            {
                "title": "My role within a team: discussing, responding, and communicating.",
                "text": "Within a team, I thoroughly enjoy engaging in discussions and providing feedback. By interpreting each other's ideas, we can approach a mutual understanding. This enables me to clarify the direction within the team and effectively plan suitable phased goals. It also allows others to understand my progress and thoughts."
            },
            {
                "title": "My professional self: Choosing what's suitable and setting goals.",
                "text": "In my work, I prioritize finding the most suitable approach over exerting excessive effort. After all, the best solution may not always be the most fitting one. Efficiency is predicated on understanding the goals and breaking down the processes. Therefore, I like to plan my work and set phased goals, allowing me to analyze and comprehend the most appropriate solutions to enhance productivity."
            },
            {
                "title": "Future",
                "text": "The ever-evolving nature of programming, with its absence of absolute answers, greatly appeals to me. I aspire to continuously improve myself in my professional journey and collaborate with teams to create intriguing projects."
            }
        ]
    }
}