{
  "nav": {
    "autobiography": "Bio",
    "project": "Project",
    "post": "Post"
  },
  "shang": {
    "name": "Hsu,Shang-Yuan",
    "born": "1993 Born in Taiwan",
    "email": "hsushangyuan@gmail.com"
  },
  "introduce": {
    "learningByDoing": {
      "title": "Learning by doing : ",
      "text": "Develop own structure to grow my self learning skill"
    },
    "workingOn": {
      "title": "Working on : ",
      "text": "Explore the appropriate procedure of work"
    },
    "teamwork": {
      "title": "Teamwork : ",
      "text": "Good at communicating & Engage in the conversation"
    }
  },
  "skills": {
    "title": "Skills",
    "list": "HTML / CSS / JavaScript / VueJS / ReactJS / NuxtJS / NextJS / NodeJS / PHP / Laravel / MySQL / Mssql / Mongodb / Git",
    "skill": {
      "title": "Skills",
      "list": [
        {
          "title": "HTML / CSS / JavaScript / VueJS / ReactJS / NuxtJS / NextJS",
          "text": "Capable of creating web pages and functionalities using front-end technologies, as well as integrating APIs. I always consider maintainability, scalability, and modular design in my programming. Most of my work involves client-side rendering (CSR), but I have also experimented with NextJS and NuxtJS to explore server-side rendering (SSR) and static site generation (SSG). Additionally, I have used Vercel to deploy projects connected with GitHub."
        },
        {
          "title": "PHP / Laravel / NodeJS / MySQL / Mssql / Mongodb",
          "text": "Capable of creating APIs according to requirements and planning databases according to the architecture. I have experience in assisting companies with optimizing and refactoring legacy projects. Additionally, in my spare time, I have experimented with using NodeJS with SocketIO and MongoDB to create a simple chat room. In my work, I have used MySQL's EXPLAIN to understand SQL execution and appropriately used indexes to enhance search speed. I have also utilized partitioning and sharding to optimize databases."
        },
        {
          "title": "Vagrant / Docker",
          "text": "Able to create consistent development and testing environments, enhancing development efficiency and deployment speed."
        },
        {
          "title": "Git / GitLab / Redmine",
          "text": "In addition to preserving development steps, Git and Redmine help track individual and team progress, ensuring communication with PMs or SAs and enhancing goal orientation and efficiency. Automatic deployment can be achieved through Webhooks in GitLab. Additionally, before releases, we conduct code reviews and prepare release documents, making the deployment process more efficient."
        },
        {
          "title": "Illustrator / Photoshop / XD",
          "text": "Having a background in fine arts equips me with the ability to communicate and discuss design aspects more effectively with designers and clients within a company setting."
        }
      ]
    }
  },
  "workExperience": {
    "title": "Work Experience",
    "list": [
      {
        "time": "2023 - present",
        "title": "Homeplus Digital Co., Ltd. Senior Software Engineer",
        "description": "Develop and maintain websites, including planning database, website vision, front-end function development, and back-end data organization"
      },
      {
        "time": "2022 - 2023",
        "title": "Cloudnifier Taiwan Front-end Engineer",
        "description": "CRM Customized page program development and maintenance"
      },
      {
        "time": "2020 - present",
        "title": "Tibame Speaker",
        "description": "Teaching UI design, HTML, CSS, JS"
      },
      {
        "time": "2020 - 2021",
        "title": "Network Learning Technology, NCU Software Engineer",
        "description": "Develop and maintain websites, including planning database, website vision, front-end function development, and back-end data organization"
      },
      {
        "time": "2015 - present",
        "title": "Freelancer",
        "description": "Website Design, UIUX Design, Logo Design, Illustration"
      }
    ]
  },
  "education": {
    "title": "Education",
    "list": [
      "Master's deegree, Plastic arts, Tainan National University of the Arts",
      "Bachelor's degree, Fine Arts, Taipei National University of the Arts"
    ]
  }
}